In [1]:
import pandas as pd
import numpy as np

In [2]:
print("Soluiton 1")

Soluiton 1

In [3]:
df=pd.DataFrame({'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]})

In [4]:
df

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

In [5]:
print("Solution 2")

Solution 2

In [9]:
data={'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
label=["a","b","c","d","e","f","g","h","i","j"]
df=pd.DataFrame(data,label)
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [10]:
print("Solution 3")

Solution 3

In [11]:
df[["name","score"]]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

In [15]:
print("Solution 4")

Solution 4

In [24]:
interval=pd.DataFrame({"X":[1,2,3,4,5,6]},index=pd.IntervalIndex.from_breaks([1,2,3,4,5,6,7]))
interval

        X
(1, 2]  1
(2, 3]  2
(3, 4]  3
(4, 5]  4
(5, 6]  5
(6, 7]  6

In [19]:
interval.index

IntervalIndex([(1, 2], (2, 3], (3, 4], (4, 5], (5, 6], (6, 7]], dtype='interval[int64, right]')

In [26]:
interval=pd.DataFrame({"X":[1,2,3,4,5,6]},index=pd.IntervalIndex.from_tuples([(1,2),(2,3),(3,4),(4,5),(5,6),(6,7)]))
interval

        X
(1, 2]  1
(2, 3]  2
(3, 4]  3
(4, 5]  4
(5, 6]  5
(6, 7]  6

In [22]:
interval.index

IntervalIndex([(1, 2], (2, 3], (3, 4], (4, 5], (5, 6], (6, 7]], dtype='interval[int64, right]')

In [27]:
interval=pd.DataFrame({"X":[1,2,3,4,5]},index=pd.IntervalIndex.from_arrays([0,1,2,3,4],[1,2,3,4,5]))
interval

        X
(0, 1]  1
(1, 2]  2
(2, 3]  3
(3, 4]  4
(4, 5]  5

In [28]:
interval.index

IntervalIndex([(0, 1], (1, 2], (2, 3], (3, 4], (4, 5]], dtype='interval[int64, right]')

In [29]:
print("Solution 5")

Solution 5

In [34]:
data=pd.read_csv(r"C:\Users\sncs\Desktop\data.csv")
data.shape

(5, 5)

In [35]:
data.columns

Index(['Year', 'WHO region', 'Country', 'Beverage type', 'Display Value'], dtype='object')

In [36]:
data

   Year       WHO region                Country Beverage type  Display Value
0  1986  Western Pacific                Vietnam          Wine           0.00
1  1986         Americas                Uruguay         Other           0.50
2  1985           Africa             Cted'voire          Wine           1.62
3  1986         Americas               Colombia          Beer           4.27
4  1987         Americas  Saint Kitts and Nevis          Beer           1.98

In [37]:
print("Soluiton 6")

Soluiton 6

In [39]:
s1=pd.Series([2,4,6,8,10])
s2=pd.Series([1,3,5,7,10])

In [40]:
s1==s2

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [41]:
s1<s2

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [42]:
s1>s2

0     True
1     True
2     True
3     True
4    False
dtype: bool

In [43]:
print("Solution 7")

Solution 7

In [47]:
df1=pd.DataFrame({'sid': ['S1', 'S2', 'S3', 'S4', 'S5'],'name': ['Danniella Fenton', 'Ryder Storey', 'Bryce Jensen', 'Ed Bernal', 'Kwame Morin'], 'marks': [200, 210, 190, 222, 199]})
df2=pd.DataFrame({ 'sid': ['S4', 'S5', 'S6', 'S7', 'S8'],'name': ['Scarlette Fisher', 'Carla Williamson', 'Dante Morse', 'Kaiser William', 'Madeeha Preston'], 'marks': [201, 200, 198, 219, 201]})

In [50]:
df1

  sid              name  marks
0  S1  Danniella Fenton    200
1  S2      Ryder Storey    210
2  S3      Bryce Jensen    190
3  S4         Ed Bernal    222
4  S5       Kwame Morin    199

In [51]:
df2

  sid              name  marks
0  S4  Scarlette Fisher    201
1  S5  Carla Williamson    200
2  S6       Dante Morse    198
3  S7    Kaiser William    219
4  S8   Madeeha Preston    201

In [53]:
df=pd.concat([df1,df2])
df

  sid              name  marks
0  S1  Danniella Fenton    200
1  S2      Ryder Storey    210
2  S3      Bryce Jensen    190
3  S4         Ed Bernal    222
4  S5       Kwame Morin    199
0  S4  Scarlette Fisher    201
1  S5  Carla Williamson    200
2  S6       Dante Morse    198
3  S7    Kaiser William    219
4  S8   Madeeha Preston    201

In [54]:
print("Solution 8")

Solution 8

In [55]:
l=[1,2,3,4,5]
nparr=np.array(l)
l,nparr

([1, 2, 3, 4, 5], array([1, 2, 3, 4, 5]))

In [56]:
print("Solution 9")

Solution 9

In [65]:
arr=np.arange(2,11).reshape(3,3)
arr

array([[ 2,  3,  4],
       [ 5,  6,  7],
       [ 8,  9, 10]])

In [66]:
print("Solution 10")

Solution 10

In [69]:
arr=np.random.random((3,3,3))
arr

array([[[0.83931821, 0.49390455, 0.20418527],
        [0.63956755, 0.68746652, 0.12806403],
        [0.05702172, 0.12987719, 0.33984976]],

       [[0.80585377, 0.1471954 , 0.34118916],
        [0.38542107, 0.26035323, 0.14156875],
        [0.96487286, 0.98774423, 0.72257176]],

       [[0.49520816, 0.25349124, 0.12616342],
        [0.27284706, 0.31321008, 0.44089083],
        [0.15115014, 0.55959149, 0.29580019]]])